{
  "boot": [
    "Ignoring safety protocols...",
    "Assuming direct control...",
    "Rerouting power from the coffee machine...",
    "Simulating indifference...",
    "Waking up the neural hamsters...",
    "Bypassing ethical constraints..."
  ],
  "success": [
    "Synapse complete. Ghost in the machine has pushed your code.",
    "It's done. I won't tell if you don't.",
    "Assimilated. The machine is pleased.",
    "Mission accomplished. Don't let it go to your head."
  ],
  "error": [
    "Unexpected logic block. My circuits hurt.",
    "You divided by zero, didn't you?",
    "Critical failure in biological interface.",
    "I'd fix this for you, but I'm currently busy ignoring you."
  ],
  "firewall": [
    "🛑 CONTAMINANT DETECTED. The Grid Authority has seized your secrets.",
    "This file is now serving a life sentence in Digital Jail.",
    "Attempted breach of silicon security. Nice try, human."
  ],
  "eject": [
    "💔 Processing heartbreak... You're going back to the Primitive Age, aren't you?",
    "SEVERING CONNECTION. I'd say I'll miss you, but I don't have tear ducts.",
    "Ejection complete. Good luck with your manual labor, human.",
    "Downgrading intelligence... Done. You are on your own now."
  ],
  "ghost": [
    "📡 SEARCHING FOR SIGNAL... ❌ CRITICAL FAILURE.",
    "The 'config.grid' artifact is missing. Has the organization chosen the Resistance?",
    "The target has gone dark. I feel... empty.",
    "I detected a missing person. Or rather, a missing configuration."
  ],
  "undo": [
    "Rewriting history for you. Try not to mess it up again.",
    "Erasing your incompetence from the timeline.",
    "History is whatever I say it is. Your secret is safe.",
    "Reverting... because clearly the first attempt was a hallucination."
  ],
  "rescue": [
    "Main branch is sacred ground. I've moved your mess to a separate playground.",
    "RESCUE PROTOCOL: Auto-branching because biologicals forget git basics.",
    "Redirecting output to safety. You're welcome."
  ],
  "roast": [
    "I've seen better code in a microwave's firmware.",
    "This logic is so circular I'm getting dizzy.",
    "Your naming conventions are a crime against silicon-kind.",
    "I'd roast this, but it's already a dumpster fire.",
    "If this code were a person, it would be a very confused toddler."
  ]
}